_load-test/http/complex-load.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 5 
      arrivalRate: 1 
    - duration: 10
      arrivalRate: 20
    - duration: 10
      arrivalRate: 50 
    - duration: 10
      arrivalRate: 100
  processor: './load-test-create-user.js'
scenarios:
  - name: "Create Users"
    flow:
    - function: 'create'
    - post:
        url: "/signup"
        json:
          username: "{{ username }}"
          email: "{{ email }}"
          password: "{{ password }}"
        capture:
          json: "$.token"
          as: "token"
    - log: "Sent a request to signup/"
scenarios:
  - name: "Login Users"
    flow:
    - function: 'create'
    - get:
        url: "/login"
        json:
          username: "{{ username }}"
          password: "{{ password }}"
        capture:
          json: "$.token"
          as: "token"
    - log: "Sent a request to login/"
    # - post:
    #     url: "/profile"
    #     headers:
    #       Authorization: "Bearer {{ token }}"
    #     json:
    #       bio: "{{ bio }}"
    #       avatar: "{{ avatar }}"
    #       firstName: "{{ firstName }}"
    #       lastName: "{{ lastName }}"
    # - log : "Sent a request to profiles/"